/* Copyright 2026 Mueej Al Basit <mueejalbasit01@gmail.com>
* COA Group Assignment:- Simple Cache controller simulation that never misses
*/

#include <iostream>
#include <unistd.h>

struct block {
    bool valid;
    int data;
    int tag;
    bool dirty;
};

int cycleTime;

bool hitCondition(int idx, int tag, bool valid) {
    if (!(idx == tag && valid == true)) {
        std::cout << "HOW IS THIS EVEN POSSIBLE????" << std::endl;
        std::cout << std::endl;
        std::cout << "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣶⣄⡀⠀⠀⠀⠀⠀⠀⠀⣀⣀⣤⣤⣤⣤⣤⣄⣀⡀⠀⠀⠀⠀⠀⠀⠀⢀⣴⣾⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀" << std::endl;
        std::cout << "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⡏⠙⢣⡄⢀⣤⡴⠿⠛⠋⠉⠀⠀⠀⠀⠀⠀⠈⠉⠻⢷⡦⣤⡀⠀⣴⠿⢻⣿⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀" << std::endl;
        std::cout << "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣇⣠⣴⡿⠟⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠛⢧⡤⢼⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀" << std::endl;
        std::cout << "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢷⣽⠟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠷⣄⠙⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀" << std::endl;
        std::cout << "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⠿⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢳⣦⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀" << std::endl;
        std::cout << "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡾⠃⠀⠀⠀⠀⠀⠀⢀⣤⣴⣶⡲⠶⣦⣄⣀⡀⢀⣀⣴⣶⣶⣶⣤⣀⠀⠀⠀⠀⠀⠀⠙⢮⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀" << std::endl;
        std::cout << "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⠟⠁⠀⠀⠀⠀⠀⠀⣸⡟⠋⣽⣿⣿⣷⡄⠀⢹⠿⠻⡅⢀⣴⣿⣿⣯⠙⠻⣦⠀⠀⠀⠀⠀⠀⠳⡿⡄⠀⠀⠀⠀⢀⠄⠀⠀⠀⠀⠀⠀" << std::endl;
        std::cout << "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⡿⠘⠁⠀⠀⠀⠀⠀⠀⢻⣾⣆⠙⣿⣿⡿⠃⢠⡾⠀⠀⠻⣌⠛⢿⣿⡟⠃⢠⠇⠀⠀⠀⠀⠀⠀⠀⠙⣼⣤⠀⠀⠀⠐⠀⠀⠀⠀⠀⠀⠀" << std::endl;
        std::cout << "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⡟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⠿⠷⣶⣀⣠⣶⣿⣤⣤⣄⡀⠈⠳⢦⣤⣴⠶⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢎⢣⠀⠈⠀⠀⠀⠀⠀⠀⠀⠀" << std::endl;
        std::cout << "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣾⠿⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣴⡿⠟⠉⠁⠀⠀⠉⠙⠷⣦⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠳⣷⡄⠀⠀⠀⠀⠀⠀⠀⠀" << std::endl;
        std::cout << "⠀⠀⠀⠀⠀⠀⠀⠀⠀⣴⡿⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣾⣿⣀⣀⠀⠀⠀⠀⠀⠀⠀⣈⣻⣷⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⠉⠙⢦⡀⠀⠀⠀⠀⠀⠀" << std::endl;
        std::cout << "⠀⠀⠀⠀⠀⠀⠀⣠⡾⡋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠻⠿⢿⣿⣻⣶⣆⣀⣴⡶⠿⣿⠿⠟⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⣄⠀⠀⠀⠀⠀" << std::endl;
        std::cout << "⠀⠀⠀⠀⠀⢠⣾⠋⠠⡿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠛⠛⠛⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠁⠀⠀⠀⠀⠀⠈⢧⡀⠀⠀⠀" << std::endl;
        std::cout << "⠀⠀⠀⠀⢰⣿⡿⠀⢰⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠠⠀⠀⠀⠀⠀⠀⠀⠀⣏⣇⠀⠀⠀" << std::endl;
        std::cout << "⠀⠀⠀⠀⢸⣿⡀⢰⡟⠀⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡀⠀⠀⠀⠀⠀⠀⠀⠀⣴⡏⢿⡀⠀⠀" << std::endl;
        std::cout << "⠀⠀⠀⠀⢸⣿⣿⡟⠀⠀⠛⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡿⠀⢸⡇⠀⠀" << std::endl;
        std::cout << "⠀⠀⠀⠀⣿⣿⣿⡇⠀⢀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠨⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⠀⠈⡇⠀⠀" << std::endl;
        std::cout << "⠀⠀⠀⢠⣿⣿⣿⣧⠀⠸⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠐⠒⠒⠒⠒⠶⠶⠦⠤⠤⠤⢤⠄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣿⡆⠀⢹⠀⠀" << std::endl;
        std::cout << "⠀⠀⠀⢸⣿⣿⣿⠹⣧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⠏⢹⣇⢠⢻⡇⠀" << std::endl;
        std::cout << "⠀⠀⢀⣾⣿⣿⡏⠀⢻⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣶⡿⠀⠀⢻⣇⠀⣧⠀" << std::endl;
        std::cout << "⠀⠀⢸⣿⣿⣿⠀⠀⠀⠻⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣤⣿⡿⠁⠀⠀⢸⣿⡆⢸⡄" << std::endl;
        std::cout << "⠀⠀⣸⡟⢿⣿⠀⠀⠀⠀⠙⢷⣀⢀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣴⣶⣿⡿⠁⠀⠀⠀⡨⣿⡿⢞⡇" << std::endl;
        std::cout << "⠀⠀⣿⠃⣿⣿⠀⠀⠀⠀⠀⠀⠻⢿⣧⣀⠂⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣤⣴⣾⣿⣿⡿⠋⠀⠀⠀⡠⠊⠃⣿⡇⡈⡇" << std::endl;
        std::cout << "⠀⠀⣿⢀⣿⡏⠀⠀⠀⠀⠀⠀⠀⠀⠙⢿⣶⣄⠀⢀⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠿⣿⣿⡿⠋⠀⠀⠀⠀⠀⡀⣈⣾⣿⢔⢀⡇" << std::endl;
        std::cout << "⠀⢀⣿⢈⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⣸⣿⣿⣷⣶⣭⣅⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣠⣴⣿⠉⠀⠀⠀⠀⠀⠀⠔⠠⢌⣛⡏⢰⢛⡇" << std::endl;
        std::cout << "⠀⢸⡟⢸⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⡿⠈⣿⣿⡏⠛⠿⠶⣦⣀⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣠⣤⡶⠶⣿⣿⣿⣿⠿⣿⠀⠀⠀⠀⠀⠀⠀⡀⢐⣯⡓⠀⠀⢗⡇" << std::endl;
        std::cout << "⠀⢸⡇⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⡇⢠⣿⣿⠇⠀⠀⠀⠀⠉⠉⠙⠛⠛⠶⠶⣶⡶⡶⠶⠞⠛⠛⠉⠉⠀⠀⠀⢹⢿⣿⠟⠈⣿⠀⠀⠀⠀⠀⠀⠀⠬⣷⡓⠅⠀⠀⣯⡇" << std::endl;
        std::cout << "⠀⢸⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⡇⢸⣿⡟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⡇⠀⢰⡏⠀⠀⠀⠀⠀⠀⠀⠐⣳⡋⠂⠀⠀⣗⣟" << std::endl;
        std::cout << "⠀⣸⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⡇⣸⣿⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⣿⣿⠀⣸⡇⠀⠀⠀⠀⠀⠀⠀⢩⣽⡡⠀⠀⠀⡓⣟" << std::endl;
        std::cout << "⢰⣿⣏⠙⢷⣄⠀⠀⠀⠀⠀⠀⠀⠀⢰⣿⣧⣿⡿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢻⣿⡆⢹⠀⠀⠀⠀⠀⠀⠀⠀⢸⣶⠅⣠⠀⠀⡝⣗" << std::endl;
        std::cout << "⢸⣿⣿⠁⣸⠻⣆⠀⠀⠀⠀⠀⠀⠀⠸⣿⣾⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⣿⣧⣾⠀⠀⠀⠀⠀⠀⠀⠀⣾⣗⡞⠁⠀⠀⢱⣻" << std::endl;
        std::cout << "⣿⣿⣿⠀⢿⣷⣿⡄⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣿⣿⣿⡟⠀⠀⠀⠀⠀⠀⠀⠰⣿⠟⠀⠀⠀⠀⡉⡮" << std::endl;
        std::cout << "⣿⣿⣿⠀⠘⡿⢿⣿⣦⠀⠀⠀⠀⠀⠀⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⡏⣿⡇⠀⠀⠀⠀⠀⠀⠀⢠⣿⣀⡴⣦⠀⠀⡠⣯" << std::endl;
        std::cout << "⢸⣿⣿⣧⣼⣄⠈⣿⣿⡆⠀⠀⠀⠀⠀⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⠁⣿⡇⠀⠀⠀⠀⠀⠀⠀⣿⣿⠋⠀⢸⠀⢠⡲⣿" << std::endl;
        std::cout << "⠈⢻⣿⣿⣯⣿⣿⠿⣿⠇⠀⠀⠀⠀⠀⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⢐⣿⠃⠀⠀⠀⠀⠀⠀⣸⣿⠟⠀⢀⣇⣰⠟⣽⣿" << std::endl;
        std::cout << "⠀⠀⠘⠻⣿⣷⣝⢻⡟⠀⠀⠀⠀⠀⠀⣿⡏⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⢸⣿⡄⠀⠀⠀⠀⠀⠀⠘⢁⣀⣘⣿⣿⡟⣰⣿⡿" << std::endl;
        std::cout << "⠀⠀⠀⠀⠘⠛⠛⠛⠋⠀⠀⠀⠀⠀⢀⣿⣧⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣸⣿⣿⣿⠇⠀⠀⠀⠀⠀⠰⣤⣬⣭⣬⣿⣿⡿⠛⡁⠄" << std::endl;
        std::cout << "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⡿⢿⡿⣇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣿⠋⠙⣿⠀⠀⠀⠀⠀⠀⠀⠈⠉⠉⠉⠉⠀⠀⠀⠀⠀" << std::endl;
        std::cout << "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣿⡷⠨⣵⣜⢦⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⡾⠇⠀⠀⠈⠻⢶⣦⣄⣀⣤⣤⣤⣤⣄⣀⠀⠀⠀⠀⠘⠁" << std::endl;
        std::cout << "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣶⠻⣿⣡⣤⠀⠈⣻⣷⣮⣟⣲⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣀⠀⠀⠀⠀⠀⠀⠀⠈⠻⣿⡛⠋⢨⣽⠻⣿⡦⣄⠀⠀⠀" << std::endl;
        std::cout << "⠀⠀⠀⠀⠀⠀⠀⠀⠀⢰⡟⣹⣯⣿⣿⣿⡏⢹⣿⣿⣿⣿⣏⢹⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠙⠛⠻⢶⣶⣖⡰⠇⢿⡄⢹⣷⣿⣝⠿⣄⢸⣿⡿⠀⠀⠀" << std::endl;
        std::cout << "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠸⣷⣿⣿⡿⠿⣿⣧⣼⣿⠿⢿⣿⣿⣶⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠛⠿⠷⠿⠾⠻⠿⠿⠿⠛⠉⠁⠀⠀⠀⠀" << std::endl;
        std::cout << "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠁⠀⠀⠈⡉⠉⠁⠀⠀⢈⠉⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡀⣀⠀⠀⠀⢀⣀⠀⠀⠀⠀⠀⠀⠀" << std::endl;
        std::cout << std::endl;
        sleep(cycleTime*10);
        return false;
    } else return true;
}

int memoryStalls() { // artificial stall to simulate memory access time
    int time = 5 + rand() % 2;
    sleep(time * cycleTime);
    return time;
}

class memory {
    int* arr;
public:
    explicit memory(const int size) {
        arr = new int[size];
        for (int i = 0; i < size; i++) {
            arr[i] = 0;
        }
    }

    int write (const int idx, const int data) {
        std::cout << "accessed memory" << std::endl;
        std::cout<< "time taken "<< memoryStalls()<< " clock cycles" << std::endl;
        arr[idx] = data;
    }

    ~memory() {
        delete[] arr;
        std::cout << "deleted memory" << std::endl;
    }
};

class cache {
    block* arr;
    memory mem;
public:
    explicit cache(const int size) : mem(size) {
        arr = new block[size];
        for (int i = 0; i < size; i++) {
            arr[i].valid = true;
            arr[i].data = 0;
            arr[i].tag = i;
            arr[i].dirty = false;
        }
    }

    int read(const int idx) const {
        hitCondition (idx, arr[idx].tag, arr[idx].valid); //checking the hit condition.......
        sleep(cycleTime);
        return arr[idx].data;
    }

    int write(const int idx, const int data) {
        hitCondition (idx, arr[idx].tag, arr[idx].valid); //checking the hit condition(2).......
        sleep(cycleTime);
        if (arr[idx].dirty == false) {
            arr[idx].dirty = true;
            arr[idx].data = data;
        } else {
            mem.write(idx, data);
            arr[idx].dirty = false;
            arr[idx].data = data;
        }
    }

    ~cache() {
        delete[] arr;
        std::cout << "deleted cache" << std::endl;
    }

};

int main() {
    cache Cache(64);
    char stop;

    int loopCount, cnt = 0;
    std::cout << "Enter loop count: ";
    std::cin >> loopCount;

    std::cout << "Enter time for 1 clock cycle (seconds): ";
    std::cin >> cycleTime;

    while (cnt++ < loopCount) {
        int req_type = rand()%2; // read = 1, write = 0
        int mem_add = rand()%10; // total 64 memory addresses

        if (req_type == 1) { //read

            std::cout << std::endl;
            std::cout << cnt << " ";
            std::cout << "=================== READ ===================" << std::endl;
            std::cout << std::endl;

            int data = Cache.read(mem_add);
            std::cout << "Value at address "<< mem_add << " is " << data << std::endl;
        } else {

            std::cout << std::endl;
            std::cout << cnt << " ";
            std::cout << "=================== WRITE ==================" << std::endl;
            std::cout << std::endl;

            int newData = rand()%10000;
            std::cout << "Selected new value: " << newData << std::endl;

            Cache.write(mem_add, newData);
            std::cout << "Updated value at address "<< mem_add << " is " << newData << std::endl;
        }

    }
}